Repository: pikougi-nabot/epochrefs-old
Catalog: commit/84000/data-translation-memory/toh44-45_84000-the-stem-array.tmx/chapters-26-37.tmx
Source language: bo
Languages: en

source: ཁོ་མོའི་ལུས་ཐམས་ཅད་ཀྱང་སྣང་བར་མཛད་དོ། །འོད་ཟེར་དེས་ཁོ་མོ་ལ་ཕོག་མ་ཐག་ཏུ་རྣམ་པར་ཐར་པ། ཆོས་ཀྱི་དབྱིངས་ཀྱི་ཚུལ་ཡོངས་སུ་འཁྱིལ་བའི་སྙིང་པོ་ཞེས་བྱ་བ་ཐོབ་པར་གྱུར་ཏོ།
en: The instant that light touched my body, I obtained the liberation called the concentrated essence of the way of the realm of Dharma

source: །རིགས་ཀྱི་བུ་དེ་ལྟར་དེ་བཞིན་གཤེགས་པ་དེ་དག་ལ་སྩོགས་པ་བསྐལ་པ་འོད་ཆེན་པོ་ལ་འཇིག་རྟེན་གྱི་ཁམས་རིན་ཆེན་འཁོར་ལོ་སྣ་ཚོགས་ཀྱིས་ཀླུབས་ཤིང་བརྒྱན་པར་སངས་རྒྱས་ལྔ་བརྒྱ་བྱུང་བར་གྱུར་པ་དེ་དག་ཐམས་ཅད་ཀྱང་མཉེས་པར་བྱས་ཏེ།
en: “Noble one, in that way I pleased and made offerings to all those tathāgatas, the five hundred buddhas that appeared in the world realm called Maṇi­cakra­vicitra­pratimaṇḍita­vyūhā during the kalpa called Mahāprabha

source: དེ་བཞིན་གཤེགས་པ་དེ་དག་ལ་ཁོ་མོས་མཆོད་པ་ཡང་བྱས་སོ། །དེ་བཞིན་གཤེགས་པ་དེ་དག་གིས་ཁོ་མོ་ལ་ཆོས་བསྟན་པ་དེ་དག་ཐམས་ཅད་ཀྱང་དྲན་ཏེ།
en: Those tathāgatas taught me the Dharma, and I remembered it all.

source: ཆོས་ཀྱི་ཚུལ་དེ་དག་ལས་ཡི་གེ་འགའ་འམ། ཚིག་འགའ་ཡང་བརྗེད་པར་མ་གྱུར་ཏོ།
en: I did not forget a single letter or a single word of those ways of the Dharma.

source: །དེ་བཞིན་གཤེགས་པ་དེ་དག་རེ་རེའི་དྲུང་དུ་འགྲོ་བའི་ཚེ་ཡང་སངས་རྒྱས་ཀྱི་ཆོས་ཡོངས་སུ་བརྗོད་པར་བྱ་བས་སེམས་ཅན་ཚད་མེད་པའི་དོན་བྱས་སོ།
en: “When I went before each of those tathāgatas, I recited the Buddha’s Dharma, and in that way I benefited countless beings.

source: །དེ་བཞིན་གཤེགས་པ་དེ་དག་རེ་རེ་ལ་ཡང་ཁོ་མོས་ཆོས་ཀྱི་དབྱིངས་ཀྱི་རང་བཞིན་རྒྱ་མཚོ་དུས་གསུམ་གྱི་ཡེ་ཤེས་ཀྱི་སྙིང་པོ་ཆོས་ཀྱི་དབྱིངས་ཤིན་ཏུ་ཡངས་པ་ཞེས་བྱ་བའི་ཐམས་ཅད་མཁྱེན་པའི་གློག་མངོན་པར་སྣང་བ་ཀུན་ཏུ་བཟང་པོའི་སྤྱོད་པ་ཐམས་ཅད་ལ་གནས་པར་ཡང་དག་པར་གཞོལ་བ་ཐོབ་པར་གྱུར་ཏེ།
en: “From each of those tathāgatas I obtained an ocean of the contents of the realm of the Dharma, an illumination from the lightning of omniscience, which was called The Extensive Realm of the Dharma That Is the Essence of the Knowledge of the Three Times , and I followed and continued all the completely good conduct.

source: རིགས་ཀྱི་བུ་ཁོ་མོ་ལ་ནི་དེ་ལྟར་ཡང་སེམས་ཀྱི་སྐད་ཅིག་རེ་རེ་ལ་དེ་བཞིན་གཤེགས་པ་མཐའ་དང་དབུས་མེད་པ་ཡོངས་སུ་སྣང་སྟེ།
en: “In that way, noble one, in each instant of mind there appear tathāgatas without outer limit or center.

source: དེ་བཞིན་གཤེགས་པ་དེ་དག་ཁོ་མོས་མཐོང་བར་གྱུར་པས་ཐམས་ཅད་མཁྱེན་པའི་ཀློག་མངོན་པར་སྣང་བ། །སྔོན་ཆད་མ་ཐོབ་པ་སྔན་ཆད་མ་མཐོང་བ དག་ཀྱང་ཁོ་མོའི་སེམས་ཀྱི་རྒྱུད་ལ་གནས་པར་གྱུར་ཏེ། འོན་ཀྱང་བྱང་ཆུབ་སེམས་དཔའ་ཀུན་ཏུ་བཟང་པོའི་སྤྱོད་པ་ལས་གཡོ་བ་མེད་དོ།
en: When I see those tathāgatas, there is the illumination of the lightning of omniscience, and that which I had not previously attained, which I had not previously seen, becomes present within the continuum of my mind, without ever deviating from the completely good conduct of the bodhisattva.

source: ཐམས་ཅད་མཁྱེན་པའི་ཀློག་མངོན་པར་སྣང་བ་ཐོབ་པ་འདི་ནི་མཐའ་དང་དབུས་མེད་པར་བསྟན་པའོ།
en: This attainment of the illumination from the lightning of omniscience is a teaching that has no outer limit or center.”

source: །དེ་ནས་མཚན་མོའི་ལྷ་མོ་སེམས་ཅན་ཀུན་ཏུ་སྐྱོང་བའི་གཟི་བརྗིད་ཀྱི་དཔལ་གྱིས་དེའི་ཚེ་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པ་འཇིག་རྟེན་ཐམས་ཅད་མངོན་དུ་གྱུར་པས། འགྲོ་བ་རྣམ་པར་འདུལ་བ་ཞེས་བྱ་བ་འདི་བརྣན་ཏེ་བསྟན་པ་དང་། རྣམ་པར་དབྱེ་བར་བྱ་བའི་ཕྱིར་སངས་རྒྱས་ཀྱི་བྱིན་གྱི་རླབས་ཀྱིས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ལ་ཚིགས་སུ་བཅད་དེ་སྨྲས་པ།
en: At that time, the night goddess Samanta­sattva­trāṇojaḥ­śrī, in order to teach further and classify the bodhisattva liberation called the manifestations that guide beings that appear in all worlds , through the blessing of the Buddha recited these verses to Sudhana, the head merchant’s son:

source: །ཟབ་མོ་བལྟ་དཀའ་ཁོང་དུ་ཆུད་དཀའ་སྟེ།
en: “The profound view is difficult; it is difficult to comprehend

source: །དུས་གསུམ་དབྱིངས་ཀུན་ཐ་དད་ཚུལ་ལྡན་ལ།
en: The different ways of the extents of the three times

source: །ཆོས་འོད་དཀྱིལ་འཁོར་ཀུན་ཏུ་འོད་འབྱུང་བའི།
en: And the completely shining domain of Dharma light.

source: །ཁོ་མོའི་ཚིག་འདི་ནོར་བཟངས་མཉམ་པར་གྱིས།
en: Listen to these words of mine, Sudhana. “Listen to me as I reveal the way,

source: །སངས་རྒྱས་ཡོན་ཏན་འདོད་པས་བྱང་ཆུབ་ཏུ།
en: Wishing for the qualities of buddhahood,

source: །ཁོ་མོས་ཐོག་མ་ཇི་ལྟར་སེམས་བསྐྱེད་དང་། །ཇི་ལྟར་ཁོ་མོས་རྣམ་ཐར་འདི་ཐོབ་པ། །དེ་དག་རྣམ་པར་ཕྱེ་བའི་ཚུལ་འདི་ཉོན། །འདི་ནས་སངས་རྒྱས་ཞིང་གི་རྡུལ་སྙེད་ཀྱི།
en: I first developed the aspiration for enlightenment And how it was I attained this liberation.

source: བསྐལ་པ་གཅིག་ནས་གཅིག་བརྒྱུད་ཕ་རོལ་ཏུ།
en: “In the past, beyond kalpa after kalpa, As many as there are atoms in a buddha realm,

source: །འཇིག་རྟེན་ཁམས་ཡངས་དྲི་མའི་སྐྱོན་མེད་པ།
en: There was a vast, stainless, faultless world realm

source: །རྣམ་སྣང་རྒྱལ་མཚན་སྒྲོན་མའི་དཔལ་བྱུང་སྟེ།
en: Called Vairocana­dhvaja­pradīpa­śrī.

source: །བསྐལ་པ་རྡུལ་དང་བྲལ་བའི་དཀྱིལ་འཁོར་བྱུང་།
en: “There had arisen the kalpa Virajomaṇḍala,

source: །དེ་ལ་སངས་རྒྱས་རིགས་ནི་རྒྱུན་མ་ཆད།
en: In which there was a succession of buddhas.

source: །དེ་ཚེ་རི་རབ་རྡུལ་ཕྲན་རབ་སྙེད་ཀྱི། །སྟོབས་བཅུ་སྐྱོན་མེད་མང་པོ་བྱུང་བར་གྱུར།
en: At that time those with the faultless ten strengths Appeared as numerous as the atoms in Sumeru

source: །དེ་ལ་བདེ་གཤེགས་ཐོག་མར་རིན་ཆེན་འོད།
en: “The first of those sugatas was Samanta­jñāna­ratnārci­śrī­guṇa­ketu­rāja,

source: །ཀུན་ཏུ་འཕྲོ་དཔལ་ཡོན་ཏན་དཔལ་རྒྱལ་བྱུང་།
en: Then there was the Jina Dharmadhvaja, then Śrīsumeru,

source: རྒྱལ་བ་ཆོས་ཀྱི་རྒྱལ་མཚན་རི་རབ་དཔལ།
en: And the fourth jina was Guṇa­keśarīśvara.

source: །ཡོན་ཏན་སེང་གེའི་དབང་པོ་རྒྱལ་བ་ཞི།
en: “Then there were the Jina Śānti­rāja, Samitāyus, Yaśaḥparvata, Guṇa­sumeru­śrī,

source: །རྒྱལ་བ་ཞི་བའི་རྒྱལ་པོ་སྐྱེ་བཅིལ་དང་། །གྲགས་པའི་རི་བོ་ཡོན་ཏན་རི་རབ་དཔལ། །རྒྱལ་བ་ཉི་མ་ཟླ་ཞལ་བཅོམ་ལྡན་འདས།
en: The Jina Abhāskara, and the Bhagavat Śaśimukha,

source: །བཅུ་པོ་དེ་དག་ཚུལ་འདི་ཐོག་མའོ།
en: And those were, in that way, the first ten.

source: །རྒྱལ་བ་ནམ་མཁའི་གཞི་དང་ཀུན་ནས་འོད། །ཕྱོགས་སུ་ཡོངས་བྱུང་དྲན་པ་རྒྱ་མཚོའི་སྒོ།
en: “Then there were the Jina Gaganālaya, and Samataprabha, Diśasaṃbhava, Smṛti­samudra­mukha,

source: །རྒྱལ་བ་མངོན་འཕགས་འོད་མངའ་རི་རབ་དཔལ།
en: The Jina Abhyudgata, Sumeruśrī,

source: །བདེ་གཤེགས་ཆོས་ཀྱི་འོད་འཕྲོ་རི་བོ་དཔལ།
en: And the Sugata Dharmārci­parvata­śrī,

source: །ཐུགས་རྗེ་ཆེ་མངའ་དགུ་པ་པདྨོས་འཕགས།
en: “Then Kāruṇika, and ninth was Padmodgata.

source: །སངས་རྒྱས་བཅུ་པ་ཆོས་དབྱིངས་མེ་ཏོག་སྟེ།
en: The tenth buddha was Dharma­dhātu­kusuma.

source: །སངས་རྒྱས་རྒྱ་མཚོ་ཡོངས་སུ་བརྗོད་པ་ལས། །ཚུལ་འདི་བཅུ་པ་གཉིས་པ་འདི་ཡིན་ནོ།
en: In that way, these were the second ten From the description of the ocean of buddhas.

source: །འོད་དཔལ་རྒྱལ་པོ་ཡེ་ཤེས་བློ་གྲོས་དང་། །སྣ་ཚོགས་དོན་དབང་དཔལ་གྱི་བློ་གྲོས་ལྷ།
en: “Then there were Prabha­ketu­rāja­mati, Jñānamati, Citrārthendra, Śrīdevamati,

source: །རྒྱལ་བ་ཤུགས་ཀྱི་རྒྱལ་བློ་ཡེ་ཤེས་དཔལ།
en: Jina Vegarājamati, Jñāna­śrī , And Avabhāsa­rāja, and Prabha­ketu­śrī,

source: །སྣང་བའི་རྒྱལ་པོ་འོད་ཀྱི་རྒྱལ་མཚན་དཔལ།
en: “Then the Jina Vikrānta­deva­gati,

source: །རྒྱལ་བ་རྣམ་པར་གནོན་པའི་ལྷ་སྟབས་དང་། །དེ་བཞིན་ཆོས་དབྱིངས་པདྨོ་བཅུ་པ་སྟེ།
en: And likewise Dharma­dhātu­padma. In that way, those were the third ten

source: །རྒྱ་ཆེན་པ་ཡོངས་སུ་བསྟན་ལས་ཚུལ་འདི་ནི།
en: Within the way of this vast teaching.

source: །ཚུལ་འདིར་བཅུ་པ་གསུམ་པ་བསྟན་པའོ། །རིན་ཆེན་འོད་འཕྲོ་རི་དཔལ་བཅོམ་ལྡན་འདས།
en: “Then there was the Bhagavat Ratnārci­parvata­śrī,

source: །དེ་ཡི་འོག་མ་ཡོན་ཏན་རྒྱ་མཚོ་དཔལ།
en: And following him were Guṇa­samudra­śrī,

source: །ཆོས་ཀྱི་འོད་དང་པདྨོ་སྙིང་པོ་དཔལ།
en: Dharmaprabha , Padma­garbha­śrī

source: །འགྲོ་བའི་ཟླ་བ་སྤྱན་ཚུལ་བདེ་བར་གཤེགས།
en: And the Sugata Gati­candra­netra­nayana,

source: །སྤོས་ཀྱི་འོད་དང་རིན་ཆེན་རི་རབ་དཔལ།
en: “Then Gandhaprabha, Maṇisumeruśrī,

source: །རྒྱལ་བ་དྲི་ཟ་ལུས་འོད་རྒྱལ་པོ་དང་། །རིན་ཆེན་སྙིང་པོ་རྒྱལ་དཔལ་གཟི་བརྗིད་ལྡན།
en: Gandharva­kāya­prabha­rāja, and Maṇi­garbha­rāja­śri­teja­vatin,

source: །རྒྱལ་བ་བཅུ་པ་ཞི་བའི་གཟུགས་ཀྱིསྟབས།
en: And the tenth jina was Praśama­rūpa­gati.

source: །དེ་ཡི་འོག་མ་རྒྱལ་བ་རྒྱ་ཆེན་བློ།
en: “Following them were the Jina Vipulabuddhi,

source: །རིན་ཆེན་འོད་དང་ནམ་མཁའི་སྤྲིན་གྱི་དཔལ།
en: Ratnaprabha, and Gagana­megha­śrī. Then there were the Jina Vara­lakṣaṇa­śrī,

source: །རྒྱལ་བ་དམ་པའི་མཚན་གྱི་དཔལ་གྱུར་དང་། །བརྟུལ་ཞུགས་དཀྱིལ་འཁོར་རང་གི་ལུས་ཀྱི་འོད།
en: Vratamaṇḍala, and Svaśarīra­prabha, “Then Nārāyaṇa­vrata­sumeru­śrī,

source: །མཐུ་ཆེན་བརྟུལ་ཞུགས་རི་རབ་དཔལ་མངའ་དང་། །རྒྱལ་བ་ཡོན་ཏན་འཁོར་ཡུག་དཔལ་གྱི་རྒྱལ།
en: The Jina Guṇa­cakravāla­śri­rāja,

source: །བཅོམ་ལྡན་མི་ཕམ་བརྟུལ་ཞུགས་རྒྱལ་མཚན་དང་། །ཤིང་གི་རི་བོ་རྒྱལ་བ་དེ་དག་བཅུ།
en: The Bhagavat Aparājita­vrata­dhvaja, And Druma­parvata, the tenth of those jinas.

source: །རྒྱལ་བ་སཱ་ལའི་རྒྱལ་པོ་དཔལ་གྱི་མཆོག །འཇིག་རྟེན་དབང་པོའི་ལུས་ནི་སྣང་བའི་འོད།
en: “Then there were the Jina Sālendra­rāja­śri­garbha, Lokendra­kāya­pratibhāsa­prabha,

source: །མངོན་པར་འཕགས་འོད་དཔལ་གྱི་བཅོམ་ལྡན་འདས།
en: The Bhagavat Abhyudgata­prabha­śrī,

source: །རྡོ་རྗེ་འོད་དང་ས་ཡི་གཟི་བརྗིད་དཔལ།
en: Vajraprabha, and Dharaṇi­teja­śrī,

source: །རྒྱལ་བ་ཟབ་ཆོས་འོད་ཀྱི་རྒྱལ་པོ་དཔལ།
en: “Then the Jina Gambhīra­dharma­guṇa­rāja­śrī,

source: །ཆོས་ཀྱི་རྒྱ་མཚོ་དབྱངས་ཀྱི་བློ་གྲོས་དང་། །རི་རབ་རྒྱལ་མཚན་དཔལ་དང་བློ་གྲོས་སྣང་།
en: Dharma­sāgara­nirghoṣa­mati, Merudhvajaśri, Prabhāsamati,

source: །རྒྱལ་བ་བཅུ་པ་རིན་ཆེན་རྒྱལ་པོ་དཔོ་དཔལ།
en: And the tenth jina, Ratnarājaśri.

source: །ཚངས་པའི་འོད་དང་རྒྱལ་བ་ནམ་མཁའ་དབྱིངས།
en: “Then there were Brahmaprabha , the Jina Gagana­ghoṣa,

source: །དེ་བཞིན་ཆོས་ཀྱི་དབྱིངས་ནི་གཟུགས་བརྙན་དཔལ།
en: Dharma­dhātu­pratibhāsa­śri,

source: །སྣང་བའི་དཀྱིལ་འཁོར་འོད་ཀྱི་བཅོམ་ལྡན་འདས།
en: The Bhagavat Āloka­maṇḍala­prabha,

source: །ཐ་དད་ཕྱོགས་མཁྱེན་ཡེ་ཤེས་བློ་གྲོས་དང་། །ནམ་མཁའི་སྒྲོན་མ་མངོན་པར་དགའ་བའི་དཔལ།
en: And Diśabheda­jñāna­prabha­ketu­mati, “Then Gagana­pradīpa , Abhirāmaśrī,

source: །རྣམ་པར་སྣང་མཛད་འོད་དཔལ་བདེ་བར་གཤེགས།
en: The Sugata Vairocana­prabha­śrī, and

source: །བསོད་ནམས་རབ་ཏུ་སྣང་དཔལ་ཞི་བའི་དཔལ།
en: Puṇya­prabhāsa­śri­śānta­śrī,

source: །བཅུ་པར་སྙིང་རྗེ་ཆེན་པོའི་སྤྲིན་གྱི་དཔལ།
en: And the tenth was Mahā­karuṇa­megha­śrī.

source: །དེ་བཞིན་ཉིད་འོད་སྟོབས་སྣང་བློ་གྲོས་དང་། །རྒྱལ་བ་འགྲོ་བ་ཐམས་ཅད་མངོན་གཟུགས་དང་། །དེ་ཚེ་རྒྱལ་བ་མངོན་འཕགས་འོད་མང་འབྱུང་།
en: “Then there were Tathatāprabha, Bala­prabhāsa­mati, And the Jina Sarva­jagadabhi­mukha­rūpa; Then there was Abhyudgata,

source: །དེ་ཡི་འོག་མ་ཞི་བའི་སྐུ་ཡི་འོད།
en: And after him was Samaśarīra.

source: །ཆོས་འཕགས་བདེ་གཤེགས་དེ་བཞིན་བྱུང་བར་འགྱུར།
en: “In the same way, there was the Sugata Dharmodgata,

source: །དེ་ཡི་འོག་མ་རླུང་གི་དྲག་ཤུལ་དཔལ།
en: And after him came Anilavegaśrī,

source: །དཔའ་བའི་རྒྱལ་མཚན་རིན་ཆེན་ལུས་ཀྱི་དཔལ།
en: Śūradhvaja, and Ratna­gātra­śrī,

source: །དུས་གསུམ་སྣང་བའི་འོད་ནི་བཅུ་པའོ།
en: And the tenth was Tryadhva­pratibhāsa­prabha. “Then there was Praṇidhāna­sāgara­prabhāsa­śrī,

source: །སྨོན་ལམ་རྒྱ་མཚོ་རབ་ཏུ་སྣང་དཔལ་དང་། །གཉིས་པ་དགོངས་པ་རྡོ་རྗེ་རི་བོ་དཔལ།
en: The second was Vajrāśaya­giri­śrī,

source: །རྒྱལ་བ་གསུམ་པ་སེང་གེ་རི་རབ་དཔལ།
en: The third jina was Harisumeruśrī,

source: །དྲན་པའི་རྒྱལ་མཚན་རྒྱལ་པོ་ཆོས་དཔལ་བློ།
en: And then there were Smṛti­ketu­rāja­śri and Dharmamati,

source: །ཤེས་རབ་སྒྲོན་མ་འོད་ཀྱི་རྒྱལ་མཚན་དཔལ།
en: “Then Prajñāpradīpa, Prabha­ketu­śrī,

source: །རྒྱལ་བ་ཆོས་དབྱིངས་ཚུལ་གྱི་ཡེ་ཤེས་སྟབས།
en: The Jina Dharma­dhātu­naya­jñāna­gati,

source: །ཆོས་ཀྱི་རྒྱ་མཚོ་བློ་གྲོས་ཡེ་ཤེས་དཔལ།
en: And Dharma­samudra­mati­jñāna­śri.

source: །ཆོས་འཛིན་པ་དང་རིན་ཆེན་སྦྱིན་དཔལ་དང་། །རྒྱལ་བ་ཡོན་ཏན་ཁོར་ཡུག་དཔལ་གྱི་སྤྲིན།
en: “Then there were Dharmadhara, Ratnadānaśri, The Jina Guṇa­cakravāla­śri­megha,

source: །བཟོད་པའི་སྒྲོན་མ་དཔལ་དང་གཟི་བརྗིད་ལྡན།
en: Kṣānti­pradīpa­śrī, and Tejovat,

source: །ཤུགས་འོད་ཞི་གནས་དབྱངས་ཀྱི་རྒྱལ་བ་དང་། །ཞི་བའི་རྒྱལ་མཚན་འགྲོ་བའི་སྒྲོན་མ་དཔལ།
en: And the Jina Vega­prabha­śamatha­ghoṣa, “Then Śānti­dhvaja­jagatpradīpa­śrī,

source: །སངས་རྒྱས་སྨོན་ལམ་ཆེན་པོ་ཤུགས་ཀྱི་དཔལ།
en: The Buddha Mahā­praṇidhi­vega­śrī, The Bhagavat Aparājita­dhvaja­bala,

source: །བཅོམ་ལྡན་གཞན་གྱིས་མི་ཐུབ་རྒྱལ་མཚན་སྟོབས།
en: And the Jina Jñānārci­sāgara­śrī.

source: །རྒྱལ་བ་ཡེ་ཤེས་འོད་འཕྲོ་རྒྱ་མཚོ་དཔལ།
en: “Then there were the Jina Dharmeśvara, Asaṅga­mati,

source: །རྒྱལ་བ་ཆོས་དབང་བློ་གྲོས་ཆགས་པ་མེད། །འགྲོ་སྐད་རྒྱ་མཚོ་དབྱངས་ཀྱི་བློ་གྲོས་དང་། །ཐམས་ཅད་དབྱངས་ཀྱི་ཡན་ལག་སྒྲ་སྐད་དཔལ།
en: Jaga­mantra­sāgara, Nirghoṣamati, Sarva­svarāṅga­ruta­ghoṣa­śrī, Vaśa­vartiyajñayaśayaṣṭi­mati,

source: །དབང་སྒྱུར་མཆོད་སྦྱིན་གྲགས་པའི་མཆོད་སྡོང་བློ།
en: “The Bhagavat Diśadeśā­mukha­jaga,

source: །ཕྱོགས་ཡུལ་འགྲོ་བ་མངོན་སུམ་བཅོམ་ལྡན་འདས།
en: Sattvāśaya­sama­śarīri­śri,

source: །སེམས་ཅན་བསམ་པར་མཉམ་པ་སྐུ་ཡི་དཔལ།
en: The Buddha Parārtha­savihāra­śrī,

source: །གཞན་ཡང་སངས་རྒྱས་གནས་དང་བཅས་པའི་དཔལ།
en: And the Jina Prakṛtīśarīra­śrī­bhadra.

source: །རྒྱལ་བ་རང་བཞིན་ལུས་དཔལ་བཟང་པོ་དང་། །དེར་ནི་རྒྱལ་བ་དེ་ལ་སྩོགས་པ་བྱུང་།
en: “Those jinas and the others appeared there.

source: །དེ་དག་བྱུང་ནས་འགྲོ་བ་སྒྲོན་མ་མཛད། །བསྐལ་པ་རི་རབ་ཤིན་ཏུ་ཕྲ་རྡུལ་སྙེད།
en: When they appeared, they were lamps for the world.

source: །བདག་གིས་རྒྱལ་བ་རྒྱ་མཚོ་དེ་དག་མཆོད།
en: I made offerings to that ocean of jinas

source: །བསྐལ་པ་སངས་རྒྱས་ཞིང་གི་རྡུལ་སྙེད་པོ།
en: For as many kalpas as there are atoms in Sumeru

source: །དེ་དག་དུ་ནི་རྒྱལ་བ་གང་བྱུང་བ།
en: “Whatever jinas have appeared in kalpas As numerous as the atoms in a buddha realm,

source: །བདེ་གཤེགས་དེ་དག་ཐམས་ཅད་བདག་གིས་མཆོད།
en: I have made offerings to all those sugatas

source: །རྣམ་པར་ཐར་པའི་ཚུལ་ནི་འདི་ལ་ཞུགས།
en: And followed this way of liberation. “I have practiced throughout endless past kalpas,

source: །རྣམ་པར་ཐར་པའི་ཚུལ་འདི་སྒོམ་བྱེད་ཅིང་། །བསྐལ་པ་མཐའ་ཡས་བདག་གི་སྔོན་སྤྱད་ཀྱིས།
en: Meditating on this way of liberation.

source: །ཁྱོད་ཀྱིས་ཐོས་ནས་ནན་ཏན་མྱུར་གྱིས་ཤིག །ཚུལ་འདི་རིང་པོ་མི་ཐོགས་ཐོབ་པར་འགྱུར།
en: Having heard it, practice it quickly, And you will attain this way before long.

source: །རིགས་ཀྱི་བུ་ཁོ་མོས་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པ་འཇིག་རྟེན་ཐམས་ཅད་མངོན་དུ་གྱུར་པས། འགྲོ་བ་རྣམ་པར་འདུལ་བ་སྟོན་པ་འདི་ཤེས་པར་ཟད་ན།
en: “Noble one, I know only this bodhisattva liberation called the manifestations that guide beings that appear in all worlds

source: ཁོ་མོས་བྱང་ཆུབ་སེམས་དཔའ་མཐའ་དང་དབུས་མེད་པའི་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་རྒྱ་མཚོ་ལ་མོས་པ་སྣ་ཚོགས་ཀྱིས་ཡང་དག་པར་གནས་པ། བསམ་པ་སྣ་ཚོགས་ཀྱིས་ལུས་དང་ལྡན་པ། །དབང་པོ་རྒྱ་མཚོ་སྣ་ཚོགས་ཡོངས་སུ་གྲུབ་པ། བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་དང་། སྨོན་ལམ་སྣ་ཚོགས་ཤིན་ཏུ་རྟོགས་པ་དེ་དག་གི་སྤྱོད་པ་ཤེས་པའམ། ཡོན་ཏན་བརྗོད་པར་ནུས་རེ་སྐན།
en: How could I know the conduct or describe the qualities of bodhisattvas who remain in the aspiration to an ocean of bodhisattva conduct that has no outer limit or center, who have bodies in accordance with the various dispositions of beings, who accomplish an ocean of various faculties, and who have the realization of the various kinds of bodhisattva conduct and prayers? “Depart, noble one.

source: །སོང་རིགས་ཀྱི་བུ་སྙིང་པོ་བྱང་ཆུབ་འདི་ཉིད་ན་ཁོ་མོ་དང་རྒྱང་མི་རིང་བ་ཞིག་ན་མཚན་མོའི་ལྷ་མོ་སྒྲ་རྒྱ་མཚོ་རབ་ཏུ་ཞི་བ་དང་ལྡན་པ་ཞེས་བྱ་བ་པདྨོའི་ཁྲི་རིན་པོ་ཆེའི་རྒྱལ་པོ་སྣང་བའི་རྒྱལ་མཚན་གྱིས་རབ་ཏུ་བརྒྱན་པ་ཞིག་ལ་འདུག་ཅིང་།
en: Here in the bodhimaṇḍa, there is the goddess of the night named Praśanta­ruta­sāgara­vatī.

source: མཚན་མོའི་ལྷ་མོ་གྲངས་མེད་པ་བརྒྱ་སྟོང་ཕྲག་བཅུའི་འཁོར་གྱིས་བསྐོར་བ་འདུག་གིས་དེའི་གན་དུ་སོང་ལ་ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་བསླབ་པར་བྱ་བ་དང་། ཇི་ལྟར་ནན་ཏན་དུ་བྱ་བ་དྲིས་ཤིག །དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཀྱིས་མཚན་མོའི་ལྷ་མོ་སེམས་ཅན་ཀུན་ཏུ་སྐྱོང་བའི་གཟི་བརྗིད་དཔལ་གྱི་རྐང་པ་གཉིས་ལ་སྤྱི་བོས་ཕྱག་འཚལ་ཏེ།
en: “She is seated on a lotus throne with the adornment of shining banners of kings of jewels in its center, and with an entourage of countless millions of night goddesses. Go to her and ask her, ‘How should a bodhisattva train in bodhisattva conduct? How should a bodhisattva practice it?’

source: མཚན་མོའི་ལྷ་མོ་སེམས་ཅན་ཀུན་ཏ་སྐྱོང་བའི་གཟི་བརྗིད་དཔལ་ལ་ལན་བརྒྱ་སྟོང་དུ་མར་གཡས་ཕྱོགས་སུ་བསྐོར་བ་བྱས་ནས་ཡང་དང་ཡང་བལྟས་ཏེ། མཚན་མོའི་ལྷ་མོ་སེམས་ཅན་ཀུན་ཏུ་སྐྱོང་བའི་གཟི་བརྗིད་དཔལ་གྱི་དྲུང་ནས་སོང་ངོ་།། །།སངས་རྒྱས་རྨད་གཅད་ཅེས་བྱ་བ་ཤིན་ཏུ་རྒྱས་པ་ཆེན་པོའི་མདོ།
en: Then Sudhana, the head merchant’s son, bowed his head to the feet of the night goddess Samanta­sattva­trāṇojaḥ­śrī, circumambulated the night goddess Samanta­sattva­trāṇojaḥ­śrī many hundreds of thousands of times, keeping her to his right, and, looking back again and again, departed from the night goddess Samanta­sattva­trāṇojaḥ­śrī.
